Autodesk.Revit.VSTA.DocumentEntryPoint.AddinFolder
The full path to the Revit VSTA module.
Remarks:  This path should be used instead of the .NET GetExecutingAssembly() result, because
the VSTA module is loaded in such a way to make that result unreliable.

Autodesk.Revit.VSTA.DocumentEntryPoint.OnShutdownEO
For Revit VSTA internal use only.

Autodesk.Revit.VSTA.DocumentEntryPoint.FinishInitializationEO
For Revit VSTA internal use only.

Autodesk.Revit.VSTA.DocumentEntryPoint.Initialize(System.Object,System.String)
For Revit VSTA internal use only.

Autodesk.Revit.VSTA.DocumentEntryPoint
For Revit VSTA use only.

Autodesk.Revit.VSTA.DocumentEntryPoint.ShowElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Shows the elements by zoom to fit.
elementIds: The set of element ids which will be shown.
Remarks: Places all the elements on the screen by moving the view.

Autodesk.Revit.VSTA.DocumentEntryPoint.ShowElements(Autodesk.Revit.DB.ElementSet)
Shows the elements by zoom to fit.
elements: The set of elements that will be shown.
Remarks: Places all the elements on the screen by moving the view.

Autodesk.Revit.VSTA.DocumentEntryPoint.ShowElements(Autodesk.Revit.DB.Element)
Shows the element by zoom to fit.
element: Element that will be shown.
Remarks: Places the element in the center of screen by moving the view.

Autodesk.Revit.VSTA.DocumentEntryPoint.ShowElements(Autodesk.Revit.DB.ElementId)
Shows one or more elements by zoom to fit.
Shows the element by zoom to fit.
elementId: Element id that will be shown.
Remarks: Places the element in the center of screen by moving the view.

Autodesk.Revit.VSTA.DocumentEntryPoint.SaveAs
Saves the document to a file name obtained from the Revit user.
Returns: False if save operation fails.
Also returns False if saving as is cancelled by an external application during 'DocumentSavingAs' event.
When function succeeds, True is returned.
Remarks: Because the argument list is null, a SaveAs dialog will be shown to query the file name.
This method may not be called unless all transactions, sub-transactions, and transaction groups that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to close the document.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.

Autodesk.Revit.VSTA.DocumentEntryPoint.SaveAndClose
Close the document, prompting the user for saving it when necessary.
Returns: False if closing procedure fails or if saving of a modified document was requested but failed.
Also returns False if closing is cancelled by an external application during 'DocumentClosing' event.
When function succeeds, True is returned.
Remarks: UI dialogs may be shown during the the call (e.g. when the document has been changed since last time it was saved) to get user responses.
The currently active document may not be closed by this function. It can only be closed via Revit's UI.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when attempting to close the currently active document.
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to close the document.